In [3]:
import pandas as pd

In [4]:
pd.read_excel("pandasExcel.xlsx")

   python
0    PyQt
1    kivy
2  Scrapy
3   Numpy
4  Pandas

In [10]:
pd.read_csv("books.csv",delimiter=";")

    Nombre  Apellido  Edad
0     Juan     Nunoz    22
1     Alex  Martinez    17
2   Andres      Cruz    18
3  Edinson   Viveros    35

In [8]:
df = {
    'Nombre':['Juan','Alex','Andres','Edison'],
    'Apellidos':['Munoz','Martinez','Cruz','Viveros'],
    'Edad': [30,31,32,33],
    'Trabajo':['Bibliotecario','Florista','Enfermero','Conserje']
}

df = pd.DataFrame(df)

df

   Nombre Apellidos  Edad        Trabajo
0    Juan     Munoz    30  Bibliotecario
1    Alex  Martinez    31       Florista
2  Andres      Cruz    32      Enfermero
3  Edison   Viveros    33       Conserje

In [15]:
df.Nombre[2][3:]

'res'